document.getElementById("text-input").oninput = function () {

    var alpabet = ["А", "Б", "В", "Г", "Д", "Е", "Ё", "Ж", "З", "И", "Й", "К", "Л", "М", "Н", "О", "П", "Р", "С", "Т", "У", "Ф", "Х", "Ц", "Ч", "Ш", "Щ", "Ъ", "Ы", "Ь", "Э", "Ю", "Я", "а", "б", "в", "г", "д", "е", "ё", "ж", "з", "и", "й", "к", "л", "м", "н", "о", "п", "р", "с", "т", "у", "ф", "х", "ц", "ч", "ш", "щ", "ъ", "ы", "ь", "э", "ю", "я", "   ", ".", ",", "—", "!", "?"];


    var Morse = ["· −", "− · · ·", "· − −", "− − ·", "− · ·", "·", "· · · −", "− − · ·", "· ·", "· − − −", " − · −", "· − · ·", "− −", "− ·", "− − −", "· − − ·", "· − ·", "· · ·", "−", "· · −", "· · − ·", "· · · ·", "− · − ·", "− − − ·", "− − − −", "− − · −", "− − · − −", "− · − −", "− · · −", "· · − · ·", "	· · − −", "· − · −", "· −", "· −", "− · · ·", "· − −", "− − ·", "− · ·", "·", "· · · −", "− − · ·", "· ·", "· − − −", " − · −", "· − · ·", "− −", "− ·", "− − −", "· − − ·", "· − ·", "· · ·", "−", "· · −", "· · − ·", "· · · ·", "− · − ·", "− − − ·", "− − − −", "− − · −", "− − · − −", "− · − −", "− · · −", "· · − · ·", "· · − −", "· − · −", "· −", "  ", "· · · · · ·", "· − · − · −", "− · · · · −", "− − · · − −", "· · − − · ·"];

    var val = this.value;
    let words = [];
    let letters = [];
    let translation = "";


    for (var i = 0; i <= val.length - 1; i++) {
        words.push(val[i]);
    }
    for (var j = 0; j <= words.length - 1; j++) {
        for (var k = 0; k <= alpabet.length - 1; k++) {
            if (words[j] === alpabet[k]) {
                letters.push(k);
            }
        }
    }
    for (var m = 0; m <= letters.length - 1; m++) {
        var symbolIndex = letters[m];
        var symbol = Morse[symbolIndex];
        translation = translation + symbol;
    }
    var output = document.getElementById("output");
    output.innerHTML = translation;
};
